# Assignment 1: Data Parsing, Cleansing and Integration
## Task 3
#### Student Name: Toh Kah Hie
#### Student ID: s3936897

Date: 26 August 2022

Version: 1.0

Environment: Python 3 and Jupyter notebook

Libraries used:
* pandas
* random


## Introduction
The problems encountered in the integration inlcudes schema conflicts, lack of column attributes, different data formats, and duplications. 

Before merging the both dataset, a global schema is established from the first dataset and the datas, column names, missing columns from second dataset is cleaned and fixed accordingly.

After the second dataset follows the same schema as the first dataset's, 2 datasets are merged together. The merged dataset will then be checked for duplicates. After duplicates are removed, a global key that uniquely identifying each job advertisement is generated. In this case, is a combination of the Title, Location, Company, ContractType and ContractTime.

##  Import libraries

In [1]:
import pandas as pd
from random import randint

### 1. Examining and loading data
The structure and schema of the csv 's3936897_dataset2.csv' is examined and mapped accordingly to match the global schema, which is:
<ul>
    <li>Id : Integer (8 digit) - not present in Dataset 2</li>
    <li>TItle: Strings (Null values as 'non-specified') - Job Title in Dataset 2</li>
    <li>Location: String (Null values as 'non-specified')</li>
    <li>Company: String (Null values as 'non-specified') - Organisation in Dataset 2</li>
    <li>ContractType: String ['full_time','part_time','non-specified'] - Full-Time Equivalent (FTE) in Dataset 2</li>
    <li>ContractTime: String  ['permanent','contract','non-specified'] - Type in Dataset 2</li>
    <li>Category: String ['IT Jobs','Healthcare & Nursing Jobs','Engineering Jobs','Accounting & FInance Jobs','Sales Jobs','Hospitality & Catering Jobs','Teaching Jobs','PR,Advertising & Marketing Jobs']</li>
    <li>Salary: Float (No null values allowed, 2 decimal places) - Monthly Payment in Dataset 2</li>
    <li>OpenDate: Datetime (YYYY-MM-DD HH:MM:SS) - Opening in Dataset 2</li>
    <li>CloseDate: Datetime (YYYY-MM-DD HH:MM:SS) - Closing in Dataset 2</li>
    <li>SourceName: String (Null values should be 'non-specified') - not present in Dataset 2</li>
</ul>

In [2]:
# Read csv files and convert them into datasets
df1 = pd.read_csv('s3936897_dataset1_solution.csv')
df2 = pd.read_csv('s3936897_dataset2.csv')
df1.head()

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,70077187,Pts Electrician,Plymouth,Resourcing Solutions,non-specified,contract,Engineering Jobs,14400.0,2012-10-15 00:00:00,2012-12-14 00:00:00,rengineeringjobs.com
1,67945005,Technical Support Engineer French Speaking,Southampton,Orleston Associates Ltd,non-specified,non-specified,Engineering Jobs,24500.0,2012-06-24 00:00:00,2012-07-24 00:00:00,rengineeringjobs.com
2,71196024,Training Administrator Rotherham,Rotherham,Randstad,non-specified,permanent,Engineering Jobs,17250.0,2012-05-10 00:00:00,2012-08-08 00:00:00,rengineeringjobs.com
3,72459197,Engineering Services Manager West London,West London,Randstad,non-specified,permanent,Engineering Jobs,46500.0,2012-07-05 12:00:00,2012-10-03 12:00:00,rengineeringjobs.com
4,71684849,"Electrical Estimator Dartford, Kent",Dartford,Randstad,non-specified,permanent,Engineering Jobs,45000.0,2012-03-20 15:00:00,2012-05-19 15:00:00,rengineeringjobs.com

In [3]:
df2.head()

,Location,Job Title,Monthly Payment,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE)
0,Berkshire,Lead CRA UK,4583.33,2012-03-08 12:00:00,Health,NaN,2012-01-08 12:00:00,SEC Recruitment,1.0
1,Bristol,Possession Manager,2812.50,2013-09-06 12:00:00,Engineering,Permanent,2013-08-07 12:00:00,Navartis Limited,1.0
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,1791.67,2013-05-02 00:00:00,Hospitality,Permanent,2013-02-01 00:00:00,Pertemps,1.0
3,Poole,HEAD OF CARE (RGN/RMN) Poole,2916.67,2013-09-24 15:00:00,Health,NaN,2013-07-26 15:00:00,Team 24 Ltd,1.0
4,Woking,SQL Server DBA,3125.00,2012-12-21 12:00:00,Information Technology,NaN,2012-11-21 12:00:00,Matchtech,1.0

In [4]:
# Check for null values present in the datasets
print(df1.info())
print()
print(df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50749 entries, 0 to 50748
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50749 non-null  int64
 1   Title         50749 non-null  object
 2   Location      50749 non-null  object
 3   Company       50749 non-null  object
 4   ContractType  50749 non-null  object
 5   ContractTime  50749 non-null  object
 6   Category      50749 non-null  object
 7   Salary        50749 non-null  float64
 8   OpenDate      50749 non-null  object
 9   CloseDate     50749 non-null  object
 10  SourceName    50749 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.3+ MB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 9 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Location                    5000 non-null   object
 1   Job Title                   5000 non-null   object
 2   Monthly Payment             5000 non-null   float64
 3   Closing                     5000 non-null   object
 4   Category                    5000 non-null   object
 5   Type                        3593 non-null   object
 6   Opening                     5000 non-null   object
 7   Organisation                4531 non-null   object
 8   Full-Time Equivalent (FTE)  5000 non-null   float64
dtypes: float64(2), object(7)
memory usage: 351.7+ KB
None

In [5]:
# Check for Data types of each column in both datasets
print(df1.dtypes)
print()
print(df2.dtypes)

Id                int64
Title            object
Location         object
Company          object
ContractType     object
ContractTime     object
Category         object
Salary          float64
OpenDate         object
CloseDate        object
SourceName       object
dtype: object

Location                       object
Job Title                      object
Monthly Payment               float64
Closing                        object
Category                       object
Type                           object
Opening                        object
Organisation                   object
Full-Time Equivalent (FTE)    float64
dtype: object

In [6]:
# Check number of data and columns in both datasets
print(df1.shape)
print(df2.shape)

(50749, 11)
(5000, 9)

### 2. Resolving schema conflicts
As mentioned above, the schema and structure of the first dataset is set as the global schema. Thus, any columns or data of the second dataset that is different from the first one would be cleaned and formatted accordingly.
Conflicts include:
* Different values of Category
* Different name and data formats of ContractType (**Full-Time Equivalent (FTE)** in float values)
* Different naming and data format of Salary (**Monthly Payment** comes in monthly values instead of yearly)
* Different values, naming and data format of ContractTime (**Type** contains null values)
* Different naming and data format of Company (**Organisation** contains null values)
* Different naming and data format of OpenDate (**Opening** in string)
* DIfferent naming and data format of CloseDate (**Closing** in string)
* Absence of Id
* Absence of SourceName

#### Conflict 1: Category
Both dataset contains the Category column and fortunately, both column have 8 distinct values. However, the values of the columns convey the same meaning but has different namings.
* IT Jobs - Information Technology
* Healthcare & Nursing Jobs - Health
* Engineering Jobs - Engineering
* Finance - Accounting & Finance Jobs
* Sales - Sales Jobs
* Hospitality & Catering Jobs - Hospitality
* Teaching Jobs - Education
* Marketing - PR, Advertising & Marketing Jobs

The structure of the first dataset will be set as the global schema and all namings of the second dataset would be replaced to values in first dataset accordingly

In [7]:
# Get distinct values of Category
print(df1['Category'].value_counts())
print()
print(df2['Category'].value_counts())

IT Jobs                             13170
Healthcare & Nursing Jobs            8066
Engineering Jobs                     7517
Accounting & Finance Jobs            6770
Sales Jobs                           4869
Hospitality & Catering Jobs          4376
Teaching Jobs                        3455
PR, Advertising & Marketing Jobs     2526
Name: Category, dtype: int64

Information Technology    1251
Health                     804
Engineering                732
Finance                    675
Sales                      517
Hospitality                436
Education                  341
Marketing                  244
Name: Category, dtype: int64

In [8]:
# Replace the values with the global schema
replace_Cat = {'Information Technology': 'IT Jobs','Health':'Healthcare & Nursing Jobs','Engineering':'Engineering Jobs','Finance':'Accounting & Finance Jobs','Sales':'Sales Jobs','Hospitality':'Hospitality & Catering Jobs','Education':'Teaching Jobs','Marketing':'PR, Advertising & Marketing Jobs'}
df2['Category'].replace(replace_Cat,inplace=True)
print(df2['Category'].value_counts())

IT Jobs                             1251
Healthcare & Nursing Jobs            804
Engineering Jobs                     732
Accounting & Finance Jobs            675
Sales Jobs                           517
Hospitality & Catering Jobs          436
Teaching Jobs                        341
PR, Advertising & Marketing Jobs     244
Name: Category, dtype: int64

#### Conflict 2: ContractType & Full-Time Equivalent (FTE)
Although both of these columns look very differently:
ContractType - (full_time, part_time)
Full-Time Equivalent - (0.2- 1.0)

They both mean the same thing, with 1.0 as full time and anything lower than that as part time.

To resolve this conflict, instead of abruptly replacing the values with full_time for 1.0 and part_time for anything else, a new column with the name 'ContractType' would be made and the new values will be filled there

In [9]:
# Get distinct values of ContractType
print(df1['ContractType'].value_counts())
print()
print(df2['Full-Time Equivalent (FTE)'].value_counts())

non-specified    37883
full_time        11283
part_time         1583
Name: ContractType, dtype: int64

1.0    4857
0.2      39
0.8      36
0.6      36
0.4      32
Name: Full-Time Equivalent (FTE), dtype: int64

In [10]:
# Map the values into the global schema
df2['ContractType'] = df2['Full-Time Equivalent (FTE)'].apply(lambda x: 'full_time' if x == 1.0 else 'part_time')
df2['ContractType'].value_counts()

full_time    4857
part_time     143
Name: ContractType, dtype: int64

#### Conflict 4: Salary & Monthly Payment
In the first dataset, the Salary column stores each job's yearly salary while in the second dataset, salary comes as montly payment. Thus, salaries in the second dataset will be multiplied by 12 to convert it into yearly salary. Moreover, the global schema for Salary is said to have 2 decimal places, thus, the end product would be rounded into 2 decimal places

In [11]:
# Multiply Monthly Payment by 12 and round to 2 decimal places
df2['Salary'] = round(df2['Monthly Payment']*12,2)
df2.head()

,Location,Job Title,Monthly Payment,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE),ContractType,Salary
0,Berkshire,Lead CRA UK,4583.33,2012-03-08 12:00:00,Healthcare & Nursing Jobs,NaN,2012-01-08 12:00:00,SEC Recruitment,1.0,full_time,54999.96
1,Bristol,Possession Manager,2812.50,2013-09-06 12:00:00,Engineering Jobs,Permanent,2013-08-07 12:00:00,Navartis Limited,1.0,full_time,33750.00
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,1791.67,2013-05-02 00:00:00,Hospitality & Catering Jobs,Permanent,2013-02-01 00:00:00,Pertemps,1.0,full_time,21500.04
3,Poole,HEAD OF CARE (RGN/RMN) Poole,2916.67,2013-09-24 15:00:00,Healthcare & Nursing Jobs,NaN,2013-07-26 15:00:00,Team 24 Ltd,1.0,full_time,35000.04
4,Woking,SQL Server DBA,3125.00,2012-12-21 12:00:00,IT Jobs,NaN,2012-11-21 12:00:00,Matchtech,1.0,full_time,37500.00

#### Conflict 5: ContractTime and Type
Looking at the distinct values of the first dataset's ContractTime and second dataset's Type column, they have different naming but columns seems to indicate the same thing. However, from above, it can be seen that the Type column contains null values while ContractTime contains the value 'non-specified'. Thus, all the values in second dataset would be transformed to values of first dataset and null values would be changed to non-specified.

In [12]:
# Get distinct values of ContractTime
print(df1['ContractTime'].value_counts())
print()
print(df2['Type'].value_counts())

permanent        31052
non-specified    14001
contract          5696
Name: ContractTime, dtype: int64

Permanent              3034
Fixed Term Contract     559
Name: Type, dtype: int64

In [13]:
# Map values of Type to the global schema and set null values as non-specified
replaceTime = {'Permanent':'permanent','Fixed Term Contract':'contract'}
df2['Type'].replace(replaceTime,inplace=True)
df2.loc[df2['Type'].isna(),'Type'] = 'non-specified'
df2.head()

,Location,Job Title,Monthly Payment,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE),ContractType,Salary
0,Berkshire,Lead CRA UK,4583.33,2012-03-08 12:00:00,Healthcare & Nursing Jobs,non-specified,2012-01-08 12:00:00,SEC Recruitment,1.0,full_time,54999.96
1,Bristol,Possession Manager,2812.50,2013-09-06 12:00:00,Engineering Jobs,permanent,2013-08-07 12:00:00,Navartis Limited,1.0,full_time,33750.00
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,1791.67,2013-05-02 00:00:00,Hospitality & Catering Jobs,permanent,2013-02-01 00:00:00,Pertemps,1.0,full_time,21500.04
3,Poole,HEAD OF CARE (RGN/RMN) Poole,2916.67,2013-09-24 15:00:00,Healthcare & Nursing Jobs,non-specified,2013-07-26 15:00:00,Team 24 Ltd,1.0,full_time,35000.04
4,Woking,SQL Server DBA,3125.00,2012-12-21 12:00:00,IT Jobs,non-specified,2012-11-21 12:00:00,Matchtech,1.0,full_time,37500.00

#### Conflict 6: Organisation
The values of the organisation will not be altered. However, it can be seen that there are null values (469 data) for the company. In the first dataset, null values are set as 'non-specified'. The same would be done on the second dataset

In [14]:
# Set Organisation that is null to non-specified
df2.loc[df2['Organisation'].isna(),'Organisation'] = 'non-specified'
df2.loc[df2['Organisation'].isna(),'Organisation']

Series([], Name: Organisation, dtype: object)

#### Conflict 7: OpenDate & Opening, CloseDate & Closing
The OpenDate and Opening, CloseDate and Closing seems to mean the same thing. However, from above, it can be seen that the data types of Opening and Closing column is of the object datatype. The date strings will all be converted into datetime.

In [15]:
# Convert Opening and Closing to datetime
df2['Opening'] = pd.to_datetime(df2['Opening'])
df2['Closing'] = pd.to_datetime(df2['Closing'])
df2.dtypes

Location                              object
Job Title                             object
Monthly Payment                      float64
Closing                       datetime64[ns]
Category                              object
Type                                  object
Opening                       datetime64[ns]
Organisation                          object
Full-Time Equivalent (FTE)           float64
ContractType                          object
Salary                               float64
dtype: object

#### Conflict 8: Id Column
The Id Column is not present in the second dataset. Thus a unique random 8 digit id is generated using random for each row of data in the second dataset.

In [16]:
# Random id generator for the rows of data in dataset 2
ids = []
for i in range(0,len(df2.index)):
    new_id = randint(10000000,99999999)
    # Keep generating until the Id is unique across the existing Id and previously generated Id
    while new_id in ids or new_id in df1['Id'].values:
        new_id = randint(10000000,99999999)
    ids.append(new_id)

In [17]:
df2['Id'] = ids
df2.head()

,Location,Job Title,Monthly Payment,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE),ContractType,Salary,Id
0,Berkshire,Lead CRA UK,4583.33,2012-03-08 12:00:00,Healthcare & Nursing Jobs,non-specified,2012-01-08 12:00:00,SEC Recruitment,1.0,full_time,54999.96,29545082
1,Bristol,Possession Manager,2812.50,2013-09-06 12:00:00,Engineering Jobs,permanent,2013-08-07 12:00:00,Navartis Limited,1.0,full_time,33750.00,80058918
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,1791.67,2013-05-02 00:00:00,Hospitality & Catering Jobs,permanent,2013-02-01 00:00:00,Pertemps,1.0,full_time,21500.04,78774483
3,Poole,HEAD OF CARE (RGN/RMN) Poole,2916.67,2013-09-24 15:00:00,Healthcare & Nursing Jobs,non-specified,2013-07-26 15:00:00,Team 24 Ltd,1.0,full_time,35000.04,90881933
4,Woking,SQL Server DBA,3125.00,2012-12-21 12:00:00,IT Jobs,non-specified,2012-11-21 12:00:00,Matchtech,1.0,full_time,37500.00,33150309

#### Conflict 9: SourceName Column
There is a SourceName column in the first dataset but not the second. However, according to the specifications, all data of the second dataset comes from a single souce www.jobhuntlisting.com. Thus, every row of data in the second dataset will have value for SourceName as that.

In [18]:
# Set all SourceName to www.jobhuntlisting.com
df2['SourceName'] = 'www.jobhuntlisting.com'
df2.head()

,Location,Job Title,Monthly Payment,Closing,Category,Type,Opening,Organisation,Full-Time Equivalent (FTE),ContractType,Salary,Id,SourceName
0,Berkshire,Lead CRA UK,4583.33,2012-03-08 12:00:00,Healthcare & Nursing Jobs,non-specified,2012-01-08 12:00:00,SEC Recruitment,1.0,full_time,54999.96,29545082,www.jobhuntlisting.com
1,Bristol,Possession Manager,2812.50,2013-09-06 12:00:00,Engineering Jobs,permanent,2013-08-07 12:00:00,Navartis Limited,1.0,full_time,33750.00,80058918,www.jobhuntlisting.com
2,Coventry,NVQ Assessor Banking/Financial Services Salary...,1791.67,2013-05-02 00:00:00,Hospitality & Catering Jobs,permanent,2013-02-01 00:00:00,Pertemps,1.0,full_time,21500.04,78774483,www.jobhuntlisting.com
3,Poole,HEAD OF CARE (RGN/RMN) Poole,2916.67,2013-09-24 15:00:00,Healthcare & Nursing Jobs,non-specified,2013-07-26 15:00:00,Team 24 Ltd,1.0,full_time,35000.04,90881933,www.jobhuntlisting.com
4,Woking,SQL Server DBA,3125.00,2012-12-21 12:00:00,IT Jobs,non-specified,2012-11-21 12:00:00,Matchtech,1.0,full_time,37500.00,33150309,www.jobhuntlisting.com

#### Conflict 10: Column Selection, Column Naming and Preparation
Now that the the values are all mapped to the global schema, it is time to select those cleaned columns and rename all of them into the correct naming

* Job Title as Title
* Location
* Category
* Organisation as Company
* ContractType
* Type as ContractTime
* Salary
* Opening as OpenDate
* Closing as CloseDate
* Id

After that, the data formats and null values are double checked to confirm that it is ready to be merged

In [19]:
df1.columns

Index(['Id', 'Title', 'Location', 'Company', 'ContractType', 'ContractTime',
       'Category', 'Salary', 'OpenDate', 'CloseDate', 'SourceName'],
      dtype='object')

In [20]:
# Keep a copy of the formatted dataset 2
ori_df2 = df2.copy()
# Drop unneccessary columns
df2 = df2.drop(['Monthly Payment','Full-Time Equivalent (FTE)'], axis=1)
# Rename the misnamed column to the global schema
df2 = df2.rename(columns={'Job Title':'Title','Organisation':'Company','Type':'ContractTime','Opening':'OpenDate','Closing':'CloseDate'})
# Sort the columns in order to the first dataset's
df2 = df2.reindex(columns=list(df1.columns))
df2.dtypes

Id                       int64
Title                   object
Location                object
Company                 object
ContractType            object
ContractTime            object
Category                object
Salary                 float64
OpenDate        datetime64[ns]
CloseDate       datetime64[ns]
SourceName              object
dtype: object

In [21]:
# Convert datatypes of the first dataset into the second dataset before merging
for y in [col for col in df1.columns if col in df2.columns]:
    if df1[y].dtype != df2[y].dtype:
        print ("Column " + y + " in df1: "+ str(df1[y].dtype) + " to " + str(df2[y].dtype))
        df1[y] = df1[y].astype(df2[y].dtype)

Column OpenDate in df1: object to datetime64[ns]
Column CloseDate in df1: object to datetime64[ns]

In [22]:
# Check if datatypes are identical
print(df1.dtypes)
print()
print(df2.dtypes)

Id                       int64
Title                   object
Location                object
Company                 object
ContractType            object
ContractTime            object
Category                object
Salary                 float64
OpenDate        datetime64[ns]
CloseDate       datetime64[ns]
SourceName              object
dtype: object

Id                       int64
Title                   object
Location                object
Company                 object
ContractType            object
ContractTime            object
Category                object
Salary                 float64
OpenDate        datetime64[ns]
CloseDate       datetime64[ns]
SourceName              object
dtype: object

In [23]:
# Check if there is no null values
print(df1.info())
print()
print(df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50749 entries, 0 to 50748
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            50749 non-null  int64
 1   Title         50749 non-null  object
 2   Location      50749 non-null  object
 3   Company       50749 non-null  object
 4   ContractType  50749 non-null  object
 5   ContractTime  50749 non-null  object
 6   Category      50749 non-null  object
 7   Salary        50749 non-null  float64
 8   OpenDate      50749 non-null  datetime64[ns]
 9   CloseDate     50749 non-null  datetime64[ns]
 10  SourceName    50749 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 4.3+ MB
None

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            5000 non-null   int64
 1   Title         5000 non-null   object
 2   Location      5000 non-null   object
 3   Company       5000 non-null   object
 4   ContractType  5000 non-null   object
 5   ContractTime  5000 non-null   object
 6   Category      5000 non-null   object
 7   Salary        5000 non-null   float64
 8   OpenDate      5000 non-null   datetime64[ns]
 9   CloseDate     5000 non-null   datetime64[ns]
 10  SourceName    5000 non-null   object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 429.8+ KB
None

### 3. Merging data
The 2 datasets are merged together before checking for any duplicates

In [24]:
# Code to merge two data sets
merged_df = pd.concat([df1,df2])
print(merged_df.shape)
merged_df.head()

(55749, 11)

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,70077187,Pts Electrician,Plymouth,Resourcing Solutions,non-specified,contract,Engineering Jobs,14400.0,2012-10-15 00:00:00,2012-12-14 00:00:00,rengineeringjobs.com
1,67945005,Technical Support Engineer French Speaking,Southampton,Orleston Associates Ltd,non-specified,non-specified,Engineering Jobs,24500.0,2012-06-24 00:00:00,2012-07-24 00:00:00,rengineeringjobs.com
2,71196024,Training Administrator Rotherham,Rotherham,Randstad,non-specified,permanent,Engineering Jobs,17250.0,2012-05-10 00:00:00,2012-08-08 00:00:00,rengineeringjobs.com
3,72459197,Engineering Services Manager West London,West London,Randstad,non-specified,permanent,Engineering Jobs,46500.0,2012-07-05 12:00:00,2012-10-03 12:00:00,rengineeringjobs.com
4,71684849,"Electrical Estimator Dartford, Kent",Dartford,Randstad,non-specified,permanent,Engineering Jobs,45000.0,2012-03-20 15:00:00,2012-05-19 15:00:00,rengineeringjobs.com

In [25]:
merged_df.dtypes

Id                       int64
Title                   object
Location                object
Company                 object
ContractType            object
ContractTime            object
Category                object
Salary                 float64
OpenDate        datetime64[ns]
CloseDate       datetime64[ns]
SourceName              object
dtype: object

### 4. Resolving data conflicts:

After the dataset is merged, it is first checked if the Id of each data is unique (should be unique). If it is unique, the values will be excluded before checking for duplications. After duplicates are checked, a global key is established and check if the key could uniquely identify each job advertisement.

#### Conflict 1: Duplications
The first conflict to check for is duplicated rows of data after merging. Columns like Id and Salary are excluded as before merging the data, it was made sure that every Id is unique. And from the previous section, some of the salary values were imputated, which would be impossible for the second dataset to have the exact value. After checking, it seems like the new datasource www.jobhuntlisting.com does not exists in the first dataset. Thus, this column would also be excluded when checking for duplicated values. All rows with duplicated values excluding those mentioned columns will be dropped with the last value being kept, which is likely to be from the second dataset.

In [26]:
# Check if the SourceName exist in the first dataset
print('Is the new SourceName in the first dataset?: ','www.jobhuntlisting.com' in list(df1['SourceName'].unique()))

Is the new SourceName in the first dataset?:  False

In [27]:
# Check if each Id is unique
print('Is every Id in the dataset unique?: ',len(merged_df['Id'].unique()) == len(merged_df))

Is every Id in the dataset unique?:  True

In [28]:
# Columns excluding Salary, Id and SourceName to check for duplicates
cols = [x for x in merged_df.columns if not x in ['Id','Salary','SourceName']]
# Lower each string values that does not have a set value as Category or ContractType or ContractTime
merged_df[['Title','Location','Company']] = merged_df[['Title','Location','Company']].apply(lambda x: x.astype(str).str.lower())
print("Total duplicated rows of data: ", len(merged_df[merged_df[cols].duplicated()]))
merged_df = merged_df.drop_duplicates(cols,keep='last')
merged_df.head()

Total duplicated rows of data:  74

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,70077187,pts electrician,plymouth,resourcing solutions,non-specified,contract,Engineering Jobs,14400.0,2012-10-15 00:00:00,2012-12-14 00:00:00,rengineeringjobs.com
1,67945005,technical support engineer french speaking,southampton,orleston associates ltd,non-specified,non-specified,Engineering Jobs,24500.0,2012-06-24 00:00:00,2012-07-24 00:00:00,rengineeringjobs.com
2,71196024,training administrator rotherham,rotherham,randstad,non-specified,permanent,Engineering Jobs,17250.0,2012-05-10 00:00:00,2012-08-08 00:00:00,rengineeringjobs.com
3,72459197,engineering services manager west london,west london,randstad,non-specified,permanent,Engineering Jobs,46500.0,2012-07-05 12:00:00,2012-10-03 12:00:00,rengineeringjobs.com
4,71684849,"electrical estimator dartford, kent",dartford,randstad,non-specified,permanent,Engineering Jobs,45000.0,2012-03-20 15:00:00,2012-05-19 15:00:00,rengineeringjobs.com

#### Finding global key for the data
The global key for the intergrated data would be the Title, Location, Company, ContractType and ContractTime. This is because:
* Title - For each company, different job titles may have similar locations and job types
* Location - There may have same roles under the same company but it is possible for the company to have different branches at different locations
* Company - Different companies may have the same jobs if they are of a similar field e.g. (IT company)
* ContractType & ContractTime - These values are required to fruther differentiate between different types of jobs

Columns like Salary, Category, OpenDate, CloseDate, Id and SourceName are considered unneccessary to uniquely identify each job advertisment because:
* Salary - Salary values may be inconsistent but similar and different jobs could all have similar salaries
* Category - Category can be considered as a summary of the job title and company, it is not specific enough to be able to uniquely identify job advertisments
* OpenDate & CloseDate - Open dates and close dates of each job advertisments could always be renewed or set different on other sources
* SourceName - The same job advertisement could always be populated to a list of different data sources for a higher chance of getting noticed by job seekers
* Id - Although it uniquely identifies each job advertisement, it can be randomly set and conveys no meaning, information or relationship to the job advertisement itself

In [29]:
# When the chosen columns are selected and checked for duplicates, it can be seen that each job advertisement can be uniquely identified within the dataset, shown by the fact that there are no duplicates found
merged_df[merged_df[['Title','Location','Company','ContractType','ContractTime']].duplicated()]

Empty DataFrame
Columns: [Id, Title, Location, Company, ContractType, ContractTime, Category, Salary, OpenDate, CloseDate, SourceName]
Index: []

#### Last formatting
Some last formatting is done to ensure the dataset is in a correct state and values are in desired formatting (Capitalize each letter)

In [30]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55675 entries, 0 to 4999
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            55675 non-null  int64
 1   Title         55675 non-null  object
 2   Location      55675 non-null  object
 3   Company       55675 non-null  object
 4   ContractType  55675 non-null  object
 5   ContractTime  55675 non-null  object
 6   Category      55675 non-null  object
 7   Salary        55675 non-null  float64
 8   OpenDate      55675 non-null  datetime64[ns]
 9   CloseDate     55675 non-null  datetime64[ns]
 10  SourceName    55675 non-null  object
dtypes: datetime64[ns](2), float64(1), int64(1), object(7)
memory usage: 5.1+ MB

In [31]:
# Round to 2 decimal places for Salary
merged_df['Salary'] = merged_df['Salary'].round(decimals=2)
# Capitalize each word of string columns
merged_df[['Title','Location','Company']] = merged_df[['Title','Location','Company']].apply(lambda x: x.astype(str).str.title() if (x.astype(str).str != 'non-specified') else 'non-specified')
merged_df.head()

,Id,Title,Location,Company,ContractType,ContractTime,Category,Salary,OpenDate,CloseDate,SourceName
0,70077187,Pts Electrician,Plymouth,Resourcing Solutions,non-specified,contract,Engineering Jobs,14400.0,2012-10-15 00:00:00,2012-12-14 00:00:00,rengineeringjobs.com
1,67945005,Technical Support Engineer French Speaking,Southampton,Orleston Associates Ltd,non-specified,non-specified,Engineering Jobs,24500.0,2012-06-24 00:00:00,2012-07-24 00:00:00,rengineeringjobs.com
2,71196024,Training Administrator Rotherham,Rotherham,Randstad,non-specified,permanent,Engineering Jobs,17250.0,2012-05-10 00:00:00,2012-08-08 00:00:00,rengineeringjobs.com
3,72459197,Engineering Services Manager West London,West London,Randstad,non-specified,permanent,Engineering Jobs,46500.0,2012-07-05 12:00:00,2012-10-03 12:00:00,rengineeringjobs.com
4,71684849,"Electrical Estimator Dartford, Kent",Dartford,Randstad,non-specified,permanent,Engineering Jobs,45000.0,2012-03-20 15:00:00,2012-05-19 15:00:00,rengineeringjobs.com

### 5. Saving the integrated and reshaped data
The integrated data is saved to a csv file named 's3936897_dataset_integrated.csv'

In [32]:
# Save integrated dataset into a csv file excluding the index
merged_df.to_csv('s3936897_dataset_integrated.csv',index=False)

## Summary of the Assessment Task
In this task, it is assumed that the second dataset is cleaned, thus no pre-processing of the dataset is done except for steps to convert the data into the global schema. Possible actions to further improve the dataset could be to find close matches of the Title and Company values.